parai/GaInOS/Bsp/9s12xep100/Project/Sources/MC9S12XEP100.c
/* Based on CPU DB MC9S12XEP100_208, version 3.00.017 (RegistersPrg V2.24) */
/* DataSheet : MC9S12XEP100 Rev. 1.16 5/2008 */

#include <mc9s12xep100.h>

/*lint -save -esym(765, *) */


/* * * * *  8-BIT REGISTERS  * * * * * * * * * * * * * * * */
volatile PORTESTR _PORTE;                                  /* Port E Data Register; 0x00000008 */
volatile DDRESTR _DDRE;                                    /* Port E Data Direction Register; 0x00000009 */
volatile MMCCTL0STR _MMCCTL0;                              /* MMC Control Register; 0x0000000A */
volatile MODESTR _MODE;                                    /* Mode Register; 0x0000000B */
volatile PUCRSTR _PUCR;                                    /* Pull-Up Control Register; 0x0000000C */
volatile RDRIVSTR _RDRIV;                                  /* Reduced Drive Register; 0x0000000D */
volatile EBICTL0STR _EBICTL0;                              /* External Bus Interface Control Register 0; 0x0000000E */
volatile EBICTL1STR _EBICTL1;                              /* External Bus Interface Control Register 1; 0x0000000F */
volatile GPAGESTR _GPAGE;                                  /* Global Page Index Register; 0x00000010 */
volatile DIRECTSTR _DIRECT;                                /* Direct Page Register; 0x00000011 */
volatile MMCCTL1STR _MMCCTL1;                              /* MMC Control Register; 0x00000013 */
volatile PPAGESTR _PPAGE;                                  /* Program Page Index Register; 0x00000015 */
volatile RPAGESTR _RPAGE;                                  /* RAM Page Index Register; 0x00000016 */
volatile EPAGESTR _EPAGE;                                  /* Data FLASH Page Index Register; 0x00000017 */
volatile ECLKCTLSTR _ECLKCTL;                              /* ECLK Control Register; 0x0000001C */
volatile IRQCRSTR _IRQCR;                                  /* Interrupt Control Register; 0x0000001E */
volatile DBGC1STR _DBGC1;                                  /* Debug Control Register 1; 0x00000020 */
volatile DBGSRSTR _DBGSR;                                  /* Debug Status Register; 0x00000021 */
volatile DBGTCRSTR _DBGTCR;                                /* Debug Trace Control Register; 0x00000022 */
volatile DBGC2STR _DBGC2;                                  /* Debug Control Register 2; 0x00000023 */
volatile DBGCNTSTR _DBGCNT;                                /* Debug Count Register; 0x00000026 */
volatile DBGSCRXSTR _DBGSCRX;                              /* Debug State Control Register; 0x00000027 */
volatile DBGXCTLSTR _DBGXCTL;                              /* Debug Comparator Control Register; 0x00000028 */
volatile DBGXAHSTR _DBGXAH;                                /* Debug Comparator Address High Register; 0x00000029 */
volatile DBGXAMSTR _DBGXAM;                                /* Debug Comparator Address Mid Register; 0x0000002A */
volatile DBGXALSTR _DBGXAL;                                /* Debug Comparator Address Low Register; 0x0000002B */
volatile DBGXDHSTR _DBGXDH;                                /* Debug Comparator Data High Register; 0x0000002C */
volatile DBGXDLSTR _DBGXDL;                                /* Debug Comparator Data Low Register; 0x0000002D */
volatile DBGXDHMSTR _DBGXDHM;                              /* Debug Comparator Data High Mask Register; 0x0000002E */
volatile DBGXDLMSTR _DBGXDLM;                              /* Debug Comparator Data Low Mask Register; 0x0000002F */
volatile PORTKSTR _PORTK;                                  /* Port K Data Register; 0x00000032 */
volatile DDRKSTR _DDRK;                                    /* Port K Data Direction Register; 0x00000033 */
volatile SYNRSTR _SYNR;                                    /* S12XECRG Synthesizer Register; 0x00000034 */
volatile REFDVSTR _REFDV;                                  /* S12XECRG Reference Divider Register; 0x00000035 */
volatile POSTDIVSTR _POSTDIV;                              /* S12XECRG Post Divider Register; 0x00000036 */
volatile CRGFLGSTR _CRGFLG;                                /* S12XECRG Flags Register; 0x00000037 */
volatile CRGINTSTR _CRGINT;                                /* S12XECRG Interrupt Enable Register; 0x00000038 */
volatile CLKSELSTR _CLKSEL;                                /* S12XECRG Clock Select Register; 0x00000039 */
volatile PLLCTLSTR _PLLCTL;                                /* S12XECRG IPLL Control Register; 0x0000003A */
volatile RTICTLSTR _RTICTL;                                /* ECRG RTI Control Register; 0x0000003B */
volatile COPCTLSTR _COPCTL;                                /* CRG COP Control Register; 0x0000003C */
volatile ARMCOPSTR _ARMCOP;                                /* CRG COP Timer Arm/Reset Register; 0x0000003F */
volatile ECT_TIOSSTR _ECT_TIOS;                            /* Timer Input Capture/Output Compare Select; 0x00000040 */
volatile ECT_CFORCSTR _ECT_CFORC;                          /* Timer Compare Force Register; 0x00000041 */
volatile ECT_OC7MSTR _ECT_OC7M;                            /* Output Compare 7 Mask Register; 0x00000042 */
volatile ECT_OC7DSTR _ECT_OC7D;                            /* Output Compare 7 Data Register; 0x00000043 */
volatile ECT_TSCR1STR _ECT_TSCR1;                          /* Timer System Control Register1; 0x00000046 */
volatile ECT_TTOVSTR _ECT_TTOV;                            /* Timer Toggle On Overflow Register; 0x00000047 */
volatile ECT_TCTL1STR _ECT_TCTL1;                          /* Timer Control Register 1; 0x00000048 */
volatile ECT_TCTL2STR _ECT_TCTL2;                          /* Timer Control Register 2; 0x00000049 */
volatile ECT_TCTL3STR _ECT_TCTL3;                          /* Timer Control Register 3; 0x0000004A */
volatile ECT_TCTL4STR _ECT_TCTL4;                          /* Timer Control Register 4; 0x0000004B */
volatile ECT_TIESTR _ECT_TIE;                              /* Timer Interrupt Enable Register; 0x0000004C */
volatile ECT_TSCR2STR _ECT_TSCR2;                          /* Timer System Control Register 2; 0x0000004D */
volatile ECT_TFLG1STR _ECT_TFLG1;                          /* Main Timer Interrupt Flag 1; 0x0000004E */
volatile ECT_TFLG2STR _ECT_TFLG2;                          /* Main Timer Interrupt Flag 2; 0x0000004F */
volatile ECT_PACTLSTR _ECT_PACTL;                          /* 16-Bit Pulse Accumulator A Control Register; 0x00000060 */
volatile ECT_PAFLGSTR _ECT_PAFLG;                          /* Pulse Accumulator A Flag Register; 0x00000061 */
volatile ECT_MCCTLSTR _ECT_MCCTL;                          /* Modulus Down Counter underflow; 0x00000066 */
volatile ECT_MCFLGSTR _ECT_MCFLG;                          /* 16-Bit Modulus Down Counter Flag Register; 0x00000067 */
volatile ECT_ICPARSTR _ECT_ICPAR;                          /* Input Control Pulse Accumulator Register; 0x00000068 */
volatile ECT_DLYCTSTR _ECT_DLYCT;                          /* Delay Counter Control Register; 0x00000069 */
volatile ECT_ICOVWSTR _ECT_ICOVW;                          /* Input Control Overwrite Register; 0x0000006A */
volatile ECT_ICSYSSTR _ECT_ICSYS;                          /* Input Control System Control Register; 0x0000006B */
volatile ECT_OCPDSTR _ECT_OCPD;                            /* Output Compare Pin Disconnect Register; 0x0000006C */
volatile ECT_PTPSRSTR _ECT_PTPSR;                          /* Precision Timer Prescaler Select Register; 0x0000006E */
volatile ECT_PTMCPSRSTR _ECT_PTMCPSR;                      /* Precision Timer Modulus Counter Prescaler Select Register; 0x0000006F */
volatile ECT_PBCTLSTR _ECT_PBCTL;                          /* 16-Bit Pulse Accumulator B Control Register; 0x00000070 */
volatile ECT_PBFLGSTR _ECT_PBFLG;                          /* Pulse Accumulator B Flag Register; 0x00000071 */
volatile ATD1STAT0STR _ATD1STAT0;                          /* ATD 1 Status Register 0; 0x00000086 */
volatile IIC1_IBADSTR _IIC1_IBAD;                          /* IIC Address Register; 0x000000B0 */
volatile IIC1_IBFDSTR _IIC1_IBFD;                          /* IIC Frequency Divider Register; 0x000000B1 */
volatile IIC1_IBCRSTR _IIC1_IBCR;                          /* IIC Control Register; 0x000000B2 */
volatile IIC1_IBSRSTR _IIC1_IBSR;                          /* IIC Status Register; 0x000000B3 */
volatile IIC1_IBDRSTR _IIC1_IBDR;                          /* IIC Data I/O Register; 0x000000B4 */
volatile IIC1_IBCR2STR _IIC1_IBCR2;                        /* IIC Control Register 2; 0x000000B5 */
volatile SCI2ACR2STR _SCI2ACR2;                            /* SCI 2 Alternative Control Register 2; 0x000000BA */
volatile SCI2CR2STR _SCI2CR2;                              /* SCI 2 Control Register 2; 0x000000BB */
volatile SCI2SR1STR _SCI2SR1;                              /* SCI 2 Status Register 1; 0x000000BC */
volatile SCI2SR2STR _SCI2SR2;                              /* SCI 2 Status Register 2; 0x000000BD */
volatile SCI2DRHSTR _SCI2DRH;                              /* SCI 2 Data Register High; 0x000000BE */
volatile SCI2DRLSTR _SCI2DRL;                              /* SCI 2 Data Register Low; 0x000000BF */
volatile SCI3ACR2STR _SCI3ACR2;                            /* SCI 3 Alternative Control Register 2; 0x000000C2 */
volatile SCI3CR2STR _SCI3CR2;                              /* SCI 3 Control Register 2; 0x000000C3 */
volatile SCI3SR1STR _SCI3SR1;                              /* SCI 3 Status Register 1; 0x000000C4 */
volatile SCI3SR2STR _SCI3SR2;                              /* SCI 3 Status Register 2; 0x000000C5 */
volatile SCI3DRHSTR _SCI3DRH;                              /* SCI 3 Data Register High; 0x000000C6 */
volatile SCI3DRLSTR _SCI3DRL;                              /* SCI 3 Data Register Low; 0x000000C7 */
volatile SCI0ACR2STR _SCI0ACR2;                            /* SCI 0 Alternative Control Register 2; 0x000000CA */
volatile SCI0CR2STR _SCI0CR2;                              /* SCI 0 Control Register 2; 0x000000CB */
volatile SCI0SR1STR _SCI0SR1;                              /* SCI 0 Status Register 1; 0x000000CC */
volatile SCI0SR2STR _SCI0SR2;                              /* SCI 0 Status Register 2; 0x000000CD */
volatile SCI0DRHSTR _SCI0DRH;                              /* SCI 0 Data Register High; 0x000000CE */
volatile SCI0DRLSTR _SCI0DRL;                              /* SCI 0 Data Register Low; 0x000000CF */
volatile SCI1ACR2STR _SCI1ACR2;                            /* SCI 1 Alternative Control Register 2; 0x000000D2 */
volatile SCI1CR2STR _SCI1CR2;                              /* SCI 1 Control Register 2; 0x000000D3 */
volatile SCI1SR1STR _SCI1SR1;                              /* SCI 1 Status Register 1; 0x000000D4 */
volatile SCI1SR2STR _SCI1SR2;                              /* SCI 1 Status Register 2; 0x000000D5 */
volatile SCI1DRHSTR _SCI1DRH;                              /* SCI 1 Data Register High; 0x000000D6 */
volatile SCI1DRLSTR _SCI1DRL;                              /* SCI 1 Data Register Low; 0x000000D7 */
volatile SPI0CR1STR _SPI0CR1;                              /* SPI 0 Control Register 1; 0x000000D8 */
volatile SPI0CR2STR _SPI0CR2;                              /* SPI 0 Control Register 2; 0x000000D9 */
volatile SPI0BRSTR _SPI0BR;                                /* SPI 0 Baud Rate Register; 0x000000DA */
volatile SPI0SRSTR _SPI0SR;                                /* SPI 0 Status Register; 0x000000DB */
volatile IIC0_IBADSTR _IIC0_IBAD;                          /* IIC Address Register; 0x000000E0 */
volatile IIC0_IBFDSTR _IIC0_IBFD;                          /* IIC Frequency Divider Register; 0x000000E1 */
volatile IIC0_IBCRSTR _IIC0_IBCR;                          /* IIC Control Register; 0x000000E2 */
volatile IIC0_IBSRSTR _IIC0_IBSR;                          /* IIC Status Register; 0x000000E3 */
volatile IIC0_IBDRSTR _IIC0_IBDR;                          /* IIC Data I/O Register; 0x000000E4 */
volatile IIC0_IBCR2STR _IIC0_IBCR2;                        /* IIC Control Register 2; 0x000000E5 */
volatile SPI1CR1STR _SPI1CR1;                              /* SPI 1 Control Register 1; 0x000000F0 */
volatile SPI1CR2STR _SPI1CR2;                              /* SPI 1 Control Register 2; 0x000000F1 */
volatile SPI1BRSTR _SPI1BR;                                /* SPI 1 Baud Rate Register; 0x000000F2 */
volatile SPI1SRSTR _SPI1SR;                                /* SPI 1 Status Register; 0x000000F3 */
volatile SPI2CR1STR _SPI2CR1;                              /* SPI 2 Control Register 1; 0x000000F8 */
volatile SPI2CR2STR _SPI2CR2;                              /* SPI 2 Control Register 2; 0x000000F9 */
volatile SPI2BRSTR _SPI2BR;                                /* SPI 2 Baud Rate Register; 0x000000FA */
volatile SPI2SRSTR _SPI2SR;                                /* SPI 2 Status Register; 0x000000FB */
volatile FCLKDIVSTR _FCLKDIV;                              /* Flash Clock Divider Register; 0x00000100 */
volatile FSECSTR _FSEC;                                    /* Flash Security Register; 0x00000101 */
volatile FCCOBIXSTR _FCCOBIX;                              /* Flash CCOB Index Register; 0x00000102 */
volatile FECCRIXSTR _FECCRIX;                              /* Flash ECCR Index Register; 0x00000103 */
volatile FCNFGSTR _FCNFG;                                  /* Flash Configuration Register; 0x00000104 */
volatile FERCNFGSTR _FERCNFG;                              /* Flash Error Configuration Register; 0x00000105 */
volatile FSTATSTR _FSTAT;                                  /* Flash Status Register; 0x00000106 */
volatile FERSTATSTR _FERSTAT;                              /* Flash Error Status Register; 0x00000107 */
volatile FPROTSTR _FPROT;                                  /* P-Flash Protection Register; 0x00000108 */
volatile EPROTSTR _EPROT;                                  /* EEE Protection Register; 0x00000109 */
volatile FOPTSTR _FOPT;                                    /* Flash Option Register; 0x00000110 */
volatile MPUFLGSTR _MPUFLG;                                /* MPU Flag Register; 0x00000114 */
volatile MPUASTAT0STR _MPUASTAT0;                          /* MPU Address Status Register 0; 0x00000115 */
volatile MPUASTAT1STR _MPUASTAT1;                          /* MPU Address Status Register 1; 0x00000116 */
volatile MPUASTAT2STR _MPUASTAT2;                          /* MPU Address Status Register 2; 0x00000117 */
volatile MPUSELSTR _MPUSEL;                                /* MPU Descriptor Select Register; 0x00000119 */
volatile MPUDESC0STR _MPUDESC0;                            /* MPU Descriptor Register 0; 0x0000011A */
volatile MPUDESC1STR _MPUDESC1;                            /* MPU Descriptor Register 1; 0x0000011B */
volatile MPUDESC2STR _MPUDESC2;                            /* MPU Descriptor Register 2; 0x0000011C */
volatile MPUDESC3STR _MPUDESC3;                            /* MPU Descriptor Register 2; 0x0000011D */
volatile MPUDESC4STR _MPUDESC4;                            /* MPU Descriptor Register 2; 0x0000011E */
volatile MPUDESC5STR _MPUDESC5;                            /* MPU Descriptor Register 2; 0x0000011F */
volatile IVBRSTR _IVBR;                                    /* Interrupt Vector Base Register; 0x00000121 */
volatile INT_XGPRIOSTR _INT_XGPRIO;                        /* XGATE Interrupt Priority Configuration Register; 0x00000126 */
volatile INT_CFADDRSTR _INT_CFADDR;                        /* Interrupt Request Configuration Address Register; 0x00000127 */
volatile INT_CFDATA0STR _INT_CFDATA0;                      /* Interrupt Request Configuration Data Register 0; 0x00000128 */
volatile INT_CFDATA1STR _INT_CFDATA1;                      /* Interrupt Request Configuration Data Register 1; 0x00000129 */
volatile INT_CFDATA2STR _INT_CFDATA2;                      /* Interrupt Request Configuration Data Register 2; 0x0000012A */
volatile INT_CFDATA3STR _INT_CFDATA3;                      /* Interrupt Request Configuration Data Register 3; 0x0000012B */
volatile INT_CFDATA4STR _INT_CFDATA4;                      /* Interrupt Request Configuration Data Register 4; 0x0000012C */
volatile INT_CFDATA5STR _INT_CFDATA5;                      /* Interrupt Request Configuration Data Register 5; 0x0000012D */
volatile INT_CFDATA6STR _INT_CFDATA6;                      /* Interrupt Request Configuration Data Register 6; 0x0000012E */
volatile INT_CFDATA7STR _INT_CFDATA7;                      /* Interrupt Request Configuration Data Register 7; 0x0000012F */
volatile SCI4ACR2STR _SCI4ACR2;                            /* SCI 4 Alternative Control Register 2; 0x00000132 */
volatile SCI4CR2STR _SCI4CR2;                              /* SCI 4 Control Register 2; 0x00000133 */
volatile SCI4SR1STR _SCI4SR1;                              /* SCI 4 Status Register 1; 0x00000134 */
volatile SCI4SR2STR _SCI4SR2;                              /* SCI 4 Status Register 2; 0x00000135 */
volatile SCI4DRHSTR _SCI4DRH;                              /* SCI 4 Data Register High; 0x00000136 */
volatile SCI4DRLSTR _SCI4DRL;                              /* SCI 4 Data Register Low; 0x00000137 */
volatile SCI5ACR2STR _SCI5ACR2;                            /* SCI 5 Alternative Control Register 2; 0x0000013A */
volatile SCI5CR2STR _SCI5CR2;                              /* SCI 5 Control Register 2; 0x0000013B */
volatile SCI5SR1STR _SCI5SR1;                              /* SCI 5 Status Register 1; 0x0000013C */
volatile SCI5SR2STR _SCI5SR2;                              /* SCI 5 Status Register 2; 0x0000013D */
volatile SCI5DRHSTR _SCI5DRH;                              /* SCI 5 Data Register High; 0x0000013E */
volatile SCI5DRLSTR _SCI5DRL;                              /* SCI 5 Data Register Low; 0x0000013F */
volatile CAN0CTL0STR _CAN0CTL0;                            /* MSCAN0 Control 0 Register; 0x00000140 */
volatile CAN0CTL1STR _CAN0CTL1;                            /* MSCAN0 Control 1 Register; 0x00000141 */
volatile CAN0BTR0STR _CAN0BTR0;                            /* MSCAN0 Bus Timing Register 0; 0x00000142 */
volatile CAN0BTR1STR _CAN0BTR1;                            /* MSCAN0 Bus Timing Register 1; 0x00000143 */
volatile CAN0RFLGSTR _CAN0RFLG;                            /* MSCAN0 Receiver Flag Register; 0x00000144 */
volatile CAN0RIERSTR _CAN0RIER;                            /* MSCAN0 Receiver Interrupt Enable Register; 0x00000145 */
volatile CAN0TFLGSTR _CAN0TFLG;                            /* MSCAN0 Transmitter Flag Register; 0x00000146 */
volatile CAN0TIERSTR _CAN0TIER;                            /* MSCAN0 Transmitter Interrupt Enable Register; 0x00000147 */
volatile CAN0TARQSTR _CAN0TARQ;                            /* MSCAN0 Transmitter Message Abort Request; 0x00000148 */
volatile CAN0TAAKSTR _CAN0TAAK;                            /* MSCAN0 Transmitter Message Abort Acknowledge; 0x00000149 */
volatile CAN0TBSELSTR _CAN0TBSEL;                          /* MSCAN0 Transmit Buffer Selection; 0x0000014A */
volatile CAN0IDACSTR _CAN0IDAC;                            /* MSCAN0 Identifier Acceptance Control Register; 0x0000014B */
volatile CAN0MISCSTR _CAN0MISC;                            /* MSCAN0 Miscellaneous Register; 0x0000014D */
volatile CAN0RXERRSTR _CAN0RXERR;                          /* MSCAN0 Receive Error Counter Register; 0x0000014E */
volatile CAN0TXERRSTR _CAN0TXERR;                          /* MSCAN0 Transmit Error Counter Register; 0x0000014F */
volatile CAN0IDAR0STR _CAN0IDAR0;                          /* MSCAN0 Identifier Acceptance Register 0; 0x00000150 */
volatile CAN0IDAR1STR _CAN0IDAR1;                          /* MSCAN0 Identifier Acceptance Register 1; 0x00000151 */
volatile CAN0IDAR2STR _CAN0IDAR2;                          /* MSCAN0 Identifier Acceptance Register 2; 0x00000152 */
volatile CAN0IDAR3STR _CAN0IDAR3;                          /* MSCAN0 Identifier Acceptance Register 3; 0x00000153 */
volatile CAN0IDMR0STR _CAN0IDMR0;                          /* MSCAN0 Identifier Mask Register 0; 0x00000154 */
volatile CAN0IDMR1STR _CAN0IDMR1;                          /* MSCAN0 Identifier Mask Register 1; 0x00000155 */
volatile CAN0IDMR2STR _CAN0IDMR2;                          /* MSCAN0 Identifier Mask Register 2; 0x00000156 */
volatile CAN0IDMR3STR _CAN0IDMR3;                          /* MSCAN0 Identifier Mask Register 3; 0x00000157 */
volatile CAN0IDAR4STR _CAN0IDAR4;                          /* MSCAN0 Identifier Acceptance Register 4; 0x00000158 */
volatile CAN0IDAR5STR _CAN0IDAR5;                          /* MSCAN0 Identifier Acceptance Register 5; 0x00000159 */
volatile CAN0IDAR6STR _CAN0IDAR6;                          /* MSCAN0 Identifier Acceptance Register 6; 0x0000015A */
volatile CAN0IDAR7STR _CAN0IDAR7;                          /* MSCAN0 Identifier Acceptance Register 7; 0x0000015B */
volatile CAN0IDMR4STR _CAN0IDMR4;                          /* MSCAN0 Identifier Mask Register 4; 0x0000015C */
volatile CAN0IDMR5STR _CAN0IDMR5;                          /* MSCAN0 Identifier Mask Register 5; 0x0000015D */
volatile CAN0IDMR6STR _CAN0IDMR6;                          /* MSCAN0 Identifier Mask Register 6; 0x0000015E */
volatile CAN0IDMR7STR _CAN0IDMR7;                          /* MSCAN0 Identifier Mask Register 7; 0x0000015F */
volatile CAN0RXIDR0STR _CAN0RXIDR0;                        /* MSCAN0 Receive Identifier Register 0; 0x00000160 */
volatile CAN0RXIDR1STR _CAN0RXIDR1;                        /* MSCAN0 Receive Identifier Register 1; 0x00000161 */
volatile CAN0RXIDR2STR _CAN0RXIDR2;                        /* MSCAN0 Receive Identifier Register 2; 0x00000162 */
volatile CAN0RXIDR3STR _CAN0RXIDR3;                        /* MSCAN0 Receive Identifier Register 3; 0x00000163 */
volatile CAN0RXDSR0STR _CAN0RXDSR0;                        /* MSCAN0 Receive Data Segment Register 0; 0x00000164 */
volatile CAN0RXDSR1STR _CAN0RXDSR1;                        /* MSCAN0 Receive Data Segment Register 1; 0x00000165 */
volatile CAN0RXDSR2STR _CAN0RXDSR2;                        /* MSCAN0 Receive Data Segment Register 2; 0x00000166 */
volatile CAN0RXDSR3STR _CAN0RXDSR3;                        /* MSCAN0 Receive Data Segment Register 3; 0x00000167 */
volatile CAN0RXDSR4STR _CAN0RXDSR4;                        /* MSCAN0 Receive Data Segment Register 4; 0x00000168 */
volatile CAN0RXDSR5STR _CAN0RXDSR5;                        /* MSCAN0 Receive Data Segment Register 5; 0x00000169 */
volatile CAN0RXDSR6STR _CAN0RXDSR6;                        /* MSCAN0 Receive Data Segment Register 6; 0x0000016A */
volatile CAN0RXDSR7STR _CAN0RXDSR7;                        /* MSCAN0 Receive Data Segment Register 7; 0x0000016B */
volatile CAN0RXDLRSTR _CAN0RXDLR;                          /* MSCAN0 Receive Data Length Register; 0x0000016C */
volatile CAN0TXIDR0STR _CAN0TXIDR0;                        /* MSCAN0 Transmit Identifier Register 0; 0x00000170 */
volatile CAN0TXIDR1STR _CAN0TXIDR1;                        /* MSCAN0 Transmit Identifier Register 1; 0x00000171 */
volatile CAN0TXIDR2STR _CAN0TXIDR2;                        /* MSCAN0 Transmit Identifier Register 2; 0x00000172 */
volatile CAN0TXIDR3STR _CAN0TXIDR3;                        /* MSCAN0 Transmit Identifier Register 3; 0x00000173 */
volatile CAN0TXDSR0STR _CAN0TXDSR0;                        /* MSCAN0 Transmit Data Segment Register 0; 0x00000174 */
volatile CAN0TXDSR1STR _CAN0TXDSR1;                        /* MSCAN0 Transmit Data Segment Register 1; 0x00000175 */
volatile CAN0TXDSR2STR _CAN0TXDSR2;                        /* MSCAN0 Transmit Data Segment Register 2; 0x00000176 */
volatile CAN0TXDSR3STR _CAN0TXDSR3;                        /* MSCAN0 Transmit Data Segment Register 3; 0x00000177 */
volatile CAN0TXDSR4STR _CAN0TXDSR4;                        /* MSCAN0 Transmit Data Segment Register 4; 0x00000178 */
volatile CAN0TXDSR5STR _CAN0TXDSR5;                        /* MSCAN0 Transmit Data Segment Register 5; 0x00000179 */
