parai/GaInOS/Bsp/9s12xep100/Project/Sources/MC9S12XEP100.c
volatile CAN0TXDSR6STR _CAN0TXDSR6;                        /* MSCAN0 Transmit Data Segment Register 6; 0x0000017A */
volatile CAN0TXDSR7STR _CAN0TXDSR7;                        /* MSCAN0 Transmit Data Segment Register 7; 0x0000017B */
volatile CAN0TXDLRSTR _CAN0TXDLR;                          /* MSCAN0 Transmit Data Length Register; 0x0000017C */
volatile CAN0TXTBPRSTR _CAN0TXTBPR;                        /* MSCAN0 Transmit Buffer Priority; 0x0000017D */
volatile CAN1CTL0STR _CAN1CTL0;                            /* MSCAN1 Control 0 Register; 0x00000180 */
volatile CAN1CTL1STR _CAN1CTL1;                            /* MSCAN1 Control 1 Register; 0x00000181 */
volatile CAN1BTR0STR _CAN1BTR0;                            /* MSCAN1 Bus Timing Register 0; 0x00000182 */
volatile CAN1BTR1STR _CAN1BTR1;                            /* MSCAN1 Bus Timing Register 1; 0x00000183 */
volatile CAN1RFLGSTR _CAN1RFLG;                            /* MSCAN1 Receiver Flag Register; 0x00000184 */
volatile CAN1RIERSTR _CAN1RIER;                            /* MSCAN1 Receiver Interrupt Enable Register; 0x00000185 */
volatile CAN1TFLGSTR _CAN1TFLG;                            /* MSCAN1 Transmitter Flag Register; 0x00000186 */
volatile CAN1TIERSTR _CAN1TIER;                            /* MSCAN1 Transmitter Interrupt Enable Register; 0x00000187 */
volatile CAN1TARQSTR _CAN1TARQ;                            /* MSCAN1 Transmitter Message Abort Request; 0x00000188 */
volatile CAN1TAAKSTR _CAN1TAAK;                            /* MSCAN1 Transmitter Message Abort Acknowledge; 0x00000189 */
volatile CAN1TBSELSTR _CAN1TBSEL;                          /* MSCAN1 Transmit Buffer Selection; 0x0000018A */
volatile CAN1IDACSTR _CAN1IDAC;                            /* MSCAN1 Identifier Acceptance Control Register; 0x0000018B */
volatile CAN1MISCSTR _CAN1MISC;                            /* MSCAN1 Miscellaneous Register; 0x0000018D */
volatile CAN1RXERRSTR _CAN1RXERR;                          /* MSCAN1 Receive Error Counter Register; 0x0000018E */
volatile CAN1TXERRSTR _CAN1TXERR;                          /* MSCAN1 Transmit Error Counter Register; 0x0000018F */
volatile CAN1IDAR0STR _CAN1IDAR0;                          /* MSCAN1 Identifier Acceptance Register 0; 0x00000190 */
volatile CAN1IDAR1STR _CAN1IDAR1;                          /* MSCAN1 Identifier Acceptance Register 1; 0x00000191 */
volatile CAN1IDAR2STR _CAN1IDAR2;                          /* MSCAN1 Identifier Acceptance Register 2; 0x00000192 */
volatile CAN1IDAR3STR _CAN1IDAR3;                          /* MSCAN1 Identifier Acceptance Register 3; 0x00000193 */
volatile CAN1IDMR0STR _CAN1IDMR0;                          /* MSCAN1 Identifier Mask Register 0; 0x00000194 */
volatile CAN1IDMR1STR _CAN1IDMR1;                          /* MSCAN1 Identifier Mask Register 1; 0x00000195 */
volatile CAN1IDMR2STR _CAN1IDMR2;                          /* MSCAN1 Identifier Mask Register 2; 0x00000196 */
volatile CAN1IDMR3STR _CAN1IDMR3;                          /* MSCAN1 Identifier Mask Register 3; 0x00000197 */
volatile CAN1IDAR4STR _CAN1IDAR4;                          /* MSCAN1 Identifier Acceptance Register 4; 0x00000198 */
volatile CAN1IDAR5STR _CAN1IDAR5;                          /* MSCAN1 Identifier Acceptance Register 5; 0x00000199 */
volatile CAN1IDAR6STR _CAN1IDAR6;                          /* MSCAN1 Identifier Acceptance Register 6; 0x0000019A */
volatile CAN1IDAR7STR _CAN1IDAR7;                          /* MSCAN1 Identifier Acceptance Register 7; 0x0000019B */
volatile CAN1IDMR4STR _CAN1IDMR4;                          /* MSCAN1 Identifier Mask Register 4; 0x0000019C */
volatile CAN1IDMR5STR _CAN1IDMR5;                          /* MSCAN1 Identifier Mask Register 5; 0x0000019D */
volatile CAN1IDMR6STR _CAN1IDMR6;                          /* MSCAN1 Identifier Mask Register 6; 0x0000019E */
volatile CAN1IDMR7STR _CAN1IDMR7;                          /* MSCAN1 Identifier Mask Register 7; 0x0000019F */
volatile CAN1RXIDR0STR _CAN1RXIDR0;                        /* MSCAN1 Receive Identifier Register 0; 0x000001A0 */
volatile CAN1RXIDR1STR _CAN1RXIDR1;                        /* MSCAN1 Receive Identifier Register 1; 0x000001A1 */
volatile CAN1RXIDR2STR _CAN1RXIDR2;                        /* MSCAN1 Receive Identifier Register 2; 0x000001A2 */
volatile CAN1RXIDR3STR _CAN1RXIDR3;                        /* MSCAN1 Receive Identifier Register 3; 0x000001A3 */
volatile CAN1RXDSR0STR _CAN1RXDSR0;                        /* MSCAN1 Receive Data Segment Register 0; 0x000001A4 */
volatile CAN1RXDSR1STR _CAN1RXDSR1;                        /* MSCAN1 Receive Data Segment Register 1; 0x000001A5 */
volatile CAN1RXDSR2STR _CAN1RXDSR2;                        /* MSCAN1 Receive Data Segment Register 2; 0x000001A6 */
volatile CAN1RXDSR3STR _CAN1RXDSR3;                        /* MSCAN1 Receive Data Segment Register 3; 0x000001A7 */
volatile CAN1RXDSR4STR _CAN1RXDSR4;                        /* MSCAN1 Receive Data Segment Register 4; 0x000001A8 */
volatile CAN1RXDSR5STR _CAN1RXDSR5;                        /* MSCAN1 Receive Data Segment Register 5; 0x000001A9 */
volatile CAN1RXDSR6STR _CAN1RXDSR6;                        /* MSCAN1 Receive Data Segment Register 6; 0x000001AA */
volatile CAN1RXDSR7STR _CAN1RXDSR7;                        /* MSCAN1 Receive Data Segment Register 7; 0x000001AB */
volatile CAN1RXDLRSTR _CAN1RXDLR;                          /* MSCAN1 Receive Data Length Register; 0x000001AC */
volatile CAN1TXIDR0STR _CAN1TXIDR0;                        /* MSCAN1 Transmit Identifier Register 0; 0x000001B0 */
volatile CAN1TXIDR1STR _CAN1TXIDR1;                        /* MSCAN1 Transmit Identifier Register 1; 0x000001B1 */
volatile CAN1TXIDR2STR _CAN1TXIDR2;                        /* MSCAN1 Transmit Identifier Register 2; 0x000001B2 */
volatile CAN1TXIDR3STR _CAN1TXIDR3;                        /* MSCAN1 Transmit Identifier Register 3; 0x000001B3 */
volatile CAN1TXDSR0STR _CAN1TXDSR0;                        /* MSCAN1 Transmit Data Segment Register 0; 0x000001B4 */
volatile CAN1TXDSR1STR _CAN1TXDSR1;                        /* MSCAN1 Transmit Data Segment Register 1; 0x000001B5 */
volatile CAN1TXDSR2STR _CAN1TXDSR2;                        /* MSCAN1 Transmit Data Segment Register 2; 0x000001B6 */
volatile CAN1TXDSR3STR _CAN1TXDSR3;                        /* MSCAN1 Transmit Data Segment Register 3; 0x000001B7 */
volatile CAN1TXDSR4STR _CAN1TXDSR4;                        /* MSCAN1 Transmit Data Segment Register 4; 0x000001B8 */
volatile CAN1TXDSR5STR _CAN1TXDSR5;                        /* MSCAN1 Transmit Data Segment Register 5; 0x000001B9 */
volatile CAN1TXDSR6STR _CAN1TXDSR6;                        /* MSCAN1 Transmit Data Segment Register 6; 0x000001BA */
volatile CAN1TXDSR7STR _CAN1TXDSR7;                        /* MSCAN1 Transmit Data Segment Register 7; 0x000001BB */
volatile CAN1TXDLRSTR _CAN1TXDLR;                          /* MSCAN1 Transmit Data Length Register; 0x000001BC */
volatile CAN1TXTBPRSTR _CAN1TXTBPR;                        /* MSCAN1 Transmit Buffer Priority; 0x000001BD */
volatile CAN2CTL0STR _CAN2CTL0;                            /* MSCAN2 Control 0 Register; 0x000001C0 */
volatile CAN2CTL1STR _CAN2CTL1;                            /* MSCAN2 Control 1 Register; 0x000001C1 */
volatile CAN2BTR0STR _CAN2BTR0;                            /* MSCAN2 Bus Timing Register 0; 0x000001C2 */
volatile CAN2BTR1STR _CAN2BTR1;                            /* MSCAN2 Bus Timing Register 1; 0x000001C3 */
volatile CAN2RFLGSTR _CAN2RFLG;                            /* MSCAN2 Receiver Flag Register; 0x000001C4 */
volatile CAN2RIERSTR _CAN2RIER;                            /* MSCAN2 Receiver Interrupt Enable Register; 0x000001C5 */
volatile CAN2TFLGSTR _CAN2TFLG;                            /* MSCAN2 Transmitter Flag Register; 0x000001C6 */
volatile CAN2TIERSTR _CAN2TIER;                            /* MSCAN2 Transmitter Interrupt Enable Register; 0x000001C7 */
volatile CAN2TARQSTR _CAN2TARQ;                            /* MSCAN2 Transmitter Message Abort Request; 0x000001C8 */
volatile CAN2TAAKSTR _CAN2TAAK;                            /* MSCAN2 Transmitter Message Abort Acknowledge; 0x000001C9 */
volatile CAN2TBSELSTR _CAN2TBSEL;                          /* MSCAN2 Transmit Buffer Selection; 0x000001CA */
volatile CAN2IDACSTR _CAN2IDAC;                            /* MSCAN2 Identifier Acceptance Control Register; 0x000001CB */
volatile CAN2MISCSTR _CAN2MISC;                            /* MSCAN2 Miscellaneous Register; 0x000001CD */
volatile CAN2RXERRSTR _CAN2RXERR;                          /* MSCAN2 Receive Error Counter Register; 0x000001CE */
volatile CAN2TXERRSTR _CAN2TXERR;                          /* MSCAN2 Transmit Error Counter Register; 0x000001CF */
volatile CAN2IDAR0STR _CAN2IDAR0;                          /* MSCAN2 Identifier Acceptance Register 0; 0x000001D0 */
volatile CAN2IDAR1STR _CAN2IDAR1;                          /* MSCAN2 Identifier Acceptance Register 1; 0x000001D1 */
volatile CAN2IDAR2STR _CAN2IDAR2;                          /* MSCAN2 Identifier Acceptance Register 2; 0x000001D2 */
volatile CAN2IDAR3STR _CAN2IDAR3;                          /* MSCAN2 Identifier Acceptance Register 3; 0x000001D3 */
volatile CAN2IDMR0STR _CAN2IDMR0;                          /* MSCAN2 Identifier Mask Register 0; 0x000001D4 */
volatile CAN2IDMR1STR _CAN2IDMR1;                          /* MSCAN2 Identifier Mask Register 1; 0x000001D5 */
volatile CAN2IDMR2STR _CAN2IDMR2;                          /* MSCAN2 Identifier Mask Register 2; 0x000001D6 */
volatile CAN2IDMR3STR _CAN2IDMR3;                          /* MSCAN2 Identifier Mask Register 3; 0x000001D7 */
volatile CAN2IDAR4STR _CAN2IDAR4;                          /* MSCAN2 Identifier Acceptance Register 4; 0x000001D8 */
volatile CAN2IDAR5STR _CAN2IDAR5;                          /* MSCAN2 Identifier Acceptance Register 5; 0x000001D9 */
volatile CAN2IDAR6STR _CAN2IDAR6;                          /* MSCAN2 Identifier Acceptance Register 6; 0x000001DA */
volatile CAN2IDAR7STR _CAN2IDAR7;                          /* MSCAN2 Identifier Acceptance Register 7; 0x000001DB */
volatile CAN2IDMR4STR _CAN2IDMR4;                          /* MSCAN2 Identifier Mask Register 4; 0x000001DC */
volatile CAN2IDMR5STR _CAN2IDMR5;                          /* MSCAN2 Identifier Mask Register 5; 0x000001DD */
volatile CAN2IDMR6STR _CAN2IDMR6;                          /* MSCAN2 Identifier Mask Register 6; 0x000001DE */
volatile CAN2IDMR7STR _CAN2IDMR7;                          /* MSCAN2 Identifier Mask Register 7; 0x000001DF */
volatile CAN2RXIDR0STR _CAN2RXIDR0;                        /* MSCAN2 Receive Identifier Register 0; 0x000001E0 */
volatile CAN2RXIDR1STR _CAN2RXIDR1;                        /* MSCAN2 Receive Identifier Register 1; 0x000001E1 */
volatile CAN2RXIDR2STR _CAN2RXIDR2;                        /* MSCAN2 Receive Identifier Register 2; 0x000001E2 */
volatile CAN2RXIDR3STR _CAN2RXIDR3;                        /* MSCAN2 Receive Identifier Register 3; 0x000001E3 */
volatile CAN2RXDSR0STR _CAN2RXDSR0;                        /* MSCAN2 Receive Data Segment Register 0; 0x000001E4 */
volatile CAN2RXDSR1STR _CAN2RXDSR1;                        /* MSCAN2 Receive Data Segment Register 1; 0x000001E5 */
volatile CAN2RXDSR2STR _CAN2RXDSR2;                        /* MSCAN2 Receive Data Segment Register 2; 0x000001E6 */
volatile CAN2RXDSR3STR _CAN2RXDSR3;                        /* MSCAN2 Receive Data Segment Register 3; 0x000001E7 */
volatile CAN2RXDSR4STR _CAN2RXDSR4;                        /* MSCAN2 Receive Data Segment Register 4; 0x000001E8 */
volatile CAN2RXDSR5STR _CAN2RXDSR5;                        /* MSCAN2 Receive Data Segment Register 5; 0x000001E9 */
volatile CAN2RXDSR6STR _CAN2RXDSR6;                        /* MSCAN2 Receive Data Segment Register 6; 0x000001EA */
volatile CAN2RXDSR7STR _CAN2RXDSR7;                        /* MSCAN2 Receive Data Segment Register 7; 0x000001EB */
volatile CAN2RXDLRSTR _CAN2RXDLR;                          /* MSCAN2 Receive Data Length Register; 0x000001EC */
volatile CAN2TXIDR0STR _CAN2TXIDR0;                        /* MSCAN2 Transmit Identifier Register 0; 0x000001F0 */
volatile CAN2TXIDR1STR _CAN2TXIDR1;                        /* MSCAN2 Transmit Identifier Register 1; 0x000001F1 */
volatile CAN2TXIDR2STR _CAN2TXIDR2;                        /* MSCAN2 Transmit Identifier Register 2; 0x000001F2 */
volatile CAN2TXIDR3STR _CAN2TXIDR3;                        /* MSCAN2 Transmit Identifier Register 3; 0x000001F3 */
volatile CAN2TXDSR0STR _CAN2TXDSR0;                        /* MSCAN2 Transmit Data Segment Register 0; 0x000001F4 */
volatile CAN2TXDSR1STR _CAN2TXDSR1;                        /* MSCAN2 Transmit Data Segment Register 1; 0x000001F5 */
volatile CAN2TXDSR2STR _CAN2TXDSR2;                        /* MSCAN2 Transmit Data Segment Register 2; 0x000001F6 */
volatile CAN2TXDSR3STR _CAN2TXDSR3;                        /* MSCAN2 Transmit Data Segment Register 3; 0x000001F7 */
volatile CAN2TXDSR4STR _CAN2TXDSR4;                        /* MSCAN2 Transmit Data Segment Register 4; 0x000001F8 */
volatile CAN2TXDSR5STR _CAN2TXDSR5;                        /* MSCAN2 Transmit Data Segment Register 5; 0x000001F9 */
volatile CAN2TXDSR6STR _CAN2TXDSR6;                        /* MSCAN2 Transmit Data Segment Register 6; 0x000001FA */
volatile CAN2TXDSR7STR _CAN2TXDSR7;                        /* MSCAN2 Transmit Data Segment Register 7; 0x000001FB */
volatile CAN2TXDLRSTR _CAN2TXDLR;                          /* MSCAN2 Transmit Data Length Register; 0x000001FC */
volatile CAN2TXTBPRSTR _CAN2TXTBPR;                        /* MSCAN2 Transmit Buffer Priority; 0x000001FD */
volatile CAN3CTL0STR _CAN3CTL0;                            /* MSCAN3 Control 0 Register; 0x00000200 */
volatile CAN3CTL1STR _CAN3CTL1;                            /* MSCAN3 Control 1 Register; 0x00000201 */
volatile CAN3BTR0STR _CAN3BTR0;                            /* MSCAN3 Bus Timing Register 0; 0x00000202 */
volatile CAN3BTR1STR _CAN3BTR1;                            /* MSCAN3 Bus Timing Register 1; 0x00000203 */
volatile CAN3RFLGSTR _CAN3RFLG;                            /* MSCAN3 Receiver Flag Register; 0x00000204 */
volatile CAN3RIERSTR _CAN3RIER;                            /* MSCAN3 Receiver Interrupt Enable Register; 0x00000205 */
volatile CAN3TFLGSTR _CAN3TFLG;                            /* MSCAN3 Transmitter Flag Register; 0x00000206 */
volatile CAN3TIERSTR _CAN3TIER;                            /* MSCAN3 Transmitter Interrupt Enable Register; 0x00000207 */
volatile CAN3TARQSTR _CAN3TARQ;                            /* MSCAN3 Transmitter Message Abort Request; 0x00000208 */
volatile CAN3TAAKSTR _CAN3TAAK;                            /* MSCAN3 Transmitter Message Abort Acknowledge; 0x00000209 */
volatile CAN3TBSELSTR _CAN3TBSEL;                          /* MSCAN3 Transmit Buffer Selection; 0x0000020A */
volatile CAN3IDACSTR _CAN3IDAC;                            /* MSCAN3 Identifier Acceptance Control Register; 0x0000020B */
volatile CAN3MISCSTR _CAN3MISC;                            /* MSCAN3 Miscellaneous Register; 0x0000020D */
volatile CAN3RXERRSTR _CAN3RXERR;                          /* MSCAN3 Receive Error Counter Register; 0x0000020E */
volatile CAN3TXERRSTR _CAN3TXERR;                          /* MSCAN3 Transmit Error Counter Register; 0x0000020F */
volatile CAN3IDAR0STR _CAN3IDAR0;                          /* MSCAN3 Identifier Acceptance Register 0; 0x00000210 */
volatile CAN3IDAR1STR _CAN3IDAR1;                          /* MSCAN3 Identifier Acceptance Register 1; 0x00000211 */
volatile CAN3IDAR2STR _CAN3IDAR2;                          /* MSCAN3 Identifier Acceptance Register 2; 0x00000212 */
volatile CAN3IDAR3STR _CAN3IDAR3;                          /* MSCAN3 Identifier Acceptance Register 3; 0x00000213 */
volatile CAN3IDMR0STR _CAN3IDMR0;                          /* MSCAN3 Identifier Mask Register 0; 0x00000214 */
volatile CAN3IDMR1STR _CAN3IDMR1;                          /* MSCAN3 Identifier Mask Register 1; 0x00000215 */
volatile CAN3IDMR2STR _CAN3IDMR2;                          /* MSCAN3 Identifier Mask Register 2; 0x00000216 */
volatile CAN3IDMR3STR _CAN3IDMR3;                          /* MSCAN3 Identifier Mask Register 3; 0x00000217 */
volatile CAN3IDAR4STR _CAN3IDAR4;                          /* MSCAN3 Identifier Acceptance Register 4; 0x00000218 */
volatile CAN3IDAR5STR _CAN3IDAR5;                          /* MSCAN3 Identifier Acceptance Register 5; 0x00000219 */
volatile CAN3IDAR6STR _CAN3IDAR6;                          /* MSCAN3 Identifier Acceptance Register 6; 0x0000021A */
volatile CAN3IDAR7STR _CAN3IDAR7;                          /* MSCAN3 Identifier Acceptance Register 7; 0x0000021B */
volatile CAN3IDMR4STR _CAN3IDMR4;                          /* MSCAN3 Identifier Mask Register 4; 0x0000021C */
volatile CAN3IDMR5STR _CAN3IDMR5;                          /* MSCAN3 Identifier Mask Register 5; 0x0000021D */
volatile CAN3IDMR6STR _CAN3IDMR6;                          /* MSCAN3 Identifier Mask Register 6; 0x0000021E */
volatile CAN3IDMR7STR _CAN3IDMR7;                          /* MSCAN3 Identifier Mask Register 7; 0x0000021F */
volatile CAN3RXIDR0STR _CAN3RXIDR0;                        /* MSCAN3 Receive Identifier Register 0; 0x00000220 */
volatile CAN3RXIDR1STR _CAN3RXIDR1;                        /* MSCAN3 Receive Identifier Register 1; 0x00000221 */
volatile CAN3RXIDR2STR _CAN3RXIDR2;                        /* MSCAN3 Receive Identifier Register 2; 0x00000222 */
volatile CAN3RXIDR3STR _CAN3RXIDR3;                        /* MSCAN3 Receive Identifier Register 3; 0x00000223 */
volatile CAN3RXDSR0STR _CAN3RXDSR0;                        /* MSCAN3 Receive Data Segment Register 0; 0x00000224 */
volatile CAN3RXDSR1STR _CAN3RXDSR1;                        /* MSCAN3 Receive Data Segment Register 1; 0x00000225 */
volatile CAN3RXDSR2STR _CAN3RXDSR2;                        /* MSCAN3 Receive Data Segment Register 2; 0x00000226 */
volatile CAN3RXDSR3STR _CAN3RXDSR3;                        /* MSCAN3 Receive Data Segment Register 3; 0x00000227 */
volatile CAN3RXDSR4STR _CAN3RXDSR4;                        /* MSCAN3 Receive Data Segment Register 4; 0x00000228 */
volatile CAN3RXDSR5STR _CAN3RXDSR5;                        /* MSCAN3 Receive Data Segment Register 5; 0x00000229 */
volatile CAN3RXDSR6STR _CAN3RXDSR6;                        /* MSCAN3 Receive Data Segment Register 6; 0x0000022A */
volatile CAN3RXDSR7STR _CAN3RXDSR7;                        /* MSCAN3 Receive Data Segment Register 7; 0x0000022B */
volatile CAN3RXDLRSTR _CAN3RXDLR;                          /* MSCAN3 Receive Data Length Register; 0x0000022C */
volatile CAN3TXIDR0STR _CAN3TXIDR0;                        /* MSCAN3 Transmit Identifier Register 0; 0x00000230 */
volatile CAN3TXIDR1STR _CAN3TXIDR1;                        /* MSCAN3 Transmit Identifier Register 1; 0x00000231 */
volatile CAN3TXIDR2STR _CAN3TXIDR2;                        /* MSCAN3 Transmit Identifier Register 2; 0x00000232 */
volatile CAN3TXIDR3STR _CAN3TXIDR3;                        /* MSCAN3 Transmit Identifier Register 3; 0x00000233 */
volatile CAN3TXDSR0STR _CAN3TXDSR0;                        /* MSCAN3 Transmit Data Segment Register 0; 0x00000234 */
volatile CAN3TXDSR1STR _CAN3TXDSR1;                        /* MSCAN3 Transmit Data Segment Register 1; 0x00000235 */
volatile CAN3TXDSR2STR _CAN3TXDSR2;                        /* MSCAN3 Transmit Data Segment Register 2; 0x00000236 */
volatile CAN3TXDSR3STR _CAN3TXDSR3;                        /* MSCAN3 Transmit Data Segment Register 3; 0x00000237 */
volatile CAN3TXDSR4STR _CAN3TXDSR4;                        /* MSCAN3 Transmit Data Segment Register 4; 0x00000238 */
volatile CAN3TXDSR5STR _CAN3TXDSR5;                        /* MSCAN3 Transmit Data Segment Register 5; 0x00000239 */
volatile CAN3TXDSR6STR _CAN3TXDSR6;                        /* MSCAN3 Transmit Data Segment Register 6; 0x0000023A */
volatile CAN3TXDSR7STR _CAN3TXDSR7;                        /* MSCAN3 Transmit Data Segment Register 7; 0x0000023B */
volatile CAN3TXDLRSTR _CAN3TXDLR;                          /* MSCAN3 Transmit Data Length Register; 0x0000023C */
volatile CAN3TXTBPRSTR _CAN3TXTBPR;                        /* MSCAN3 Transmit Buffer Priority; 0x0000023D */
volatile PTTSTR _PTT;                                      /* Port T Data Register; 0x00000240 */
volatile PTITSTR _PTIT;                                    /* Port T Input Register; 0x00000241 */
volatile DDRTSTR _DDRT;                                    /* Port T Data Direction Register; 0x00000242 */
volatile RDRTSTR _RDRT;                                    /* Port T Reduced Drive Register; 0x00000243 */
volatile PERTSTR _PERT;                                    /* Port T Pull Device Enable Register; 0x00000244 */
volatile PPSTSTR _PPST;                                    /* Port T Polarity Select Register; 0x00000245 */
volatile PTSSTR _PTS;                                      /* Port S Data Register; 0x00000248 */
volatile PTISSTR _PTIS;                                    /* Port S Input Register; 0x00000249 */
volatile DDRSSTR _DDRS;                                    /* Port S Data Direction Register; 0x0000024A */
volatile RDRSSTR _RDRS;                                    /* Port S Reduced Drive Register; 0x0000024B */
volatile PERSSTR _PERS;                                    /* Port S Pull Device Enable Register; 0x0000024C */
volatile PPSSSTR _PPSS;                                    /* Port S Polarity Select Register; 0x0000024D */
volatile WOMSSTR _WOMS;                                    /* Port S Wired-Or Mode Register; 0x0000024E */
volatile PTMSTR _PTM;                                      /* Port M Data Register; 0x00000250 */
volatile PTIMSTR _PTIM;                                    /* Port M Input Register; 0x00000251 */
volatile DDRMSTR _DDRM;                                    /* Port M Data Direction Register; 0x00000252 */
volatile RDRMSTR _RDRM;                                    /* Port M Reduced Drive Register; 0x00000253 */
volatile PERMSTR _PERM;                                    /* Port M Pull Device Enable Register; 0x00000254 */
volatile PPSMSTR _PPSM;                                    /* Port M Polarity Select Register; 0x00000255 */
volatile WOMMSTR _WOMM;                                    /* Port M Wired-Or Mode Register; 0x00000256 */
volatile MODRRSTR _MODRR;                                  /* Module Routing Register; 0x00000257 */
volatile PTPSTR _PTP;                                      /* Port P Data Register; 0x00000258 */
volatile PTIPSTR _PTIP;                                    /* Port P Input Register; 0x00000259 */
volatile DDRPSTR _DDRP;                                    /* Port P Data Direction Register; 0x0000025A */
volatile RDRPSTR _RDRP;                                    /* Port P Reduced Drive Register; 0x0000025B */
volatile PERPSTR _PERP;                                    /* Port P Pull Device Enable Register; 0x0000025C */
volatile PPSPSTR _PPSP;                                    /* Port P Polarity Select Register; 0x0000025D */
volatile PIEPSTR _PIEP;                                    /* Port P Interrupt Enable Register; 0x0000025E */
volatile PIFPSTR _PIFP;                                    /* Port P Interrupt Flag Register; 0x0000025F */
volatile PTHSTR _PTH;                                      /* Port H Data Register; 0x00000260 */
volatile PTIHSTR _PTIH;                                    /* Port H Input Register; 0x00000261 */
volatile DDRHSTR _DDRH;                                    /* Port H Data Direction Register; 0x00000262 */
