parai/GaInOS/Bsp/9s12xep100/Project/Sources/MC9S12XEP100.c
volatile RDRHSTR _RDRH;                                    /* Port H Reduced Drive Register; 0x00000263 */
volatile PERHSTR _PERH;                                    /* Port H Pull Device Enable Register; 0x00000264 */
volatile PPSHSTR _PPSH;                                    /* Port H Polarity Select Register; 0x00000265 */
volatile PIEHSTR _PIEH;                                    /* Port H Interrupt Enable Register; 0x00000266 */
volatile PIFHSTR _PIFH;                                    /* Port H Interrupt Flag Register; 0x00000267 */
volatile PTJSTR _PTJ;                                      /* Port J Data Register; 0x00000268 */
volatile PTIJSTR _PTIJ;                                    /* Port J Input Register; 0x00000269 */
volatile DDRJSTR _DDRJ;                                    /* Port J Data Direction Register; 0x0000026A */
volatile RDRJSTR _RDRJ;                                    /* Port J Reduced Drive Register; 0x0000026B */
volatile PERJSTR _PERJ;                                    /* Port J Pull Device Enable Register; 0x0000026C */
volatile PPSJSTR _PPSJ;                                    /* Port J Polarity Select Register; 0x0000026D */
volatile PIEJSTR _PIEJ;                                    /* Port J Interrupt Enable Register; 0x0000026E */
volatile PIFJSTR _PIFJ;                                    /* Port J Interrupt Flag Register; 0x0000026F */
volatile CAN4CTL0STR _CAN4CTL0;                            /* MSCAN4 Control 0 Register; 0x00000280 */
volatile CAN4CTL1STR _CAN4CTL1;                            /* MSCAN4 Control 1 Register; 0x00000281 */
volatile CAN4BTR0STR _CAN4BTR0;                            /* MSCAN4 Bus Timing Register 0; 0x00000282 */
volatile CAN4BTR1STR _CAN4BTR1;                            /* MSCAN4 Bus Timing Register 1; 0x00000283 */
volatile CAN4RFLGSTR _CAN4RFLG;                            /* MSCAN4 Receiver Flag Register; 0x00000284 */
volatile CAN4RIERSTR _CAN4RIER;                            /* MSCAN4 Receiver Interrupt Enable Register; 0x00000285 */
volatile CAN4TFLGSTR _CAN4TFLG;                            /* MSCAN4 Transmitter Flag Register; 0x00000286 */
volatile CAN4TIERSTR _CAN4TIER;                            /* MSCAN4 Transmitter Interrupt Enable Register; 0x00000287 */
volatile CAN4TARQSTR _CAN4TARQ;                            /* MSCAN4 Transmitter Message Abort Request; 0x00000288 */
volatile CAN4TAAKSTR _CAN4TAAK;                            /* MSCAN4 Transmitter Message Abort Acknowledge; 0x00000289 */
volatile CAN4TBSELSTR _CAN4TBSEL;                          /* MSCAN4 Transmit Buffer Selection; 0x0000028A */
volatile CAN4IDACSTR _CAN4IDAC;                            /* MSCAN4 Identifier Acceptance Control Register; 0x0000028B */
volatile CAN4MISCSTR _CAN4MISC;                            /* MSCAN4 Miscellaneous Register; 0x0000028D */
volatile CAN4RXERRSTR _CAN4RXERR;                          /* MSCAN4 Receive Error Counter Register; 0x0000028E */
volatile CAN4TXERRSTR _CAN4TXERR;                          /* MSCAN4 Transmit Error Counter Register; 0x0000028F */
volatile CAN4IDAR0STR _CAN4IDAR0;                          /* MSCAN4 Identifier Acceptance Register 0; 0x00000290 */
volatile CAN4IDAR1STR _CAN4IDAR1;                          /* MSCAN4 Identifier Acceptance Register 1; 0x00000291 */
volatile CAN4IDAR2STR _CAN4IDAR2;                          /* MSCAN4 Identifier Acceptance Register 2; 0x00000292 */
volatile CAN4IDAR3STR _CAN4IDAR3;                          /* MSCAN4 Identifier Acceptance Register 3; 0x00000293 */
volatile CAN4IDMR0STR _CAN4IDMR0;                          /* MSCAN4 Identifier Mask Register 0; 0x00000294 */
volatile CAN4IDMR1STR _CAN4IDMR1;                          /* MSCAN4 Identifier Mask Register 1; 0x00000295 */
volatile CAN4IDMR2STR _CAN4IDMR2;                          /* MSCAN4 Identifier Mask Register 2; 0x00000296 */
volatile CAN4IDMR3STR _CAN4IDMR3;                          /* MSCAN4 Identifier Mask Register 3; 0x00000297 */
volatile CAN4IDAR4STR _CAN4IDAR4;                          /* MSCAN4 Identifier Acceptance Register 4; 0x00000298 */
volatile CAN4IDAR5STR _CAN4IDAR5;                          /* MSCAN4 Identifier Acceptance Register 5; 0x00000299 */
volatile CAN4IDAR6STR _CAN4IDAR6;                          /* MSCAN4 Identifier Acceptance Register 6; 0x0000029A */
volatile CAN4IDAR7STR _CAN4IDAR7;                          /* MSCAN4 Identifier Acceptance Register 7; 0x0000029B */
volatile CAN4IDMR4STR _CAN4IDMR4;                          /* MSCAN4 Identifier Mask Register 4; 0x0000029C */
volatile CAN4IDMR5STR _CAN4IDMR5;                          /* MSCAN4 Identifier Mask Register 5; 0x0000029D */
volatile CAN4IDMR6STR _CAN4IDMR6;                          /* MSCAN4 Identifier Mask Register 6; 0x0000029E */
volatile CAN4IDMR7STR _CAN4IDMR7;                          /* MSCAN4 Identifier Mask Register 7; 0x0000029F */
volatile CAN4RXIDR0STR _CAN4RXIDR0;                        /* MSCAN4 Receive Identifier Register 0; 0x000002A0 */
volatile CAN4RXIDR1STR _CAN4RXIDR1;                        /* MSCAN4 Receive Identifier Register 1; 0x000002A1 */
volatile CAN4RXIDR2STR _CAN4RXIDR2;                        /* MSCAN4 Receive Identifier Register 2; 0x000002A2 */
volatile CAN4RXIDR3STR _CAN4RXIDR3;                        /* MSCAN4 Receive Identifier Register 3; 0x000002A3 */
volatile CAN4RXDSR0STR _CAN4RXDSR0;                        /* MSCAN4 Receive Data Segment Register 0; 0x000002A4 */
volatile CAN4RXDSR1STR _CAN4RXDSR1;                        /* MSCAN4 Receive Data Segment Register 1; 0x000002A5 */
volatile CAN4RXDSR2STR _CAN4RXDSR2;                        /* MSCAN4 Receive Data Segment Register 2; 0x000002A6 */
volatile CAN4RXDSR3STR _CAN4RXDSR3;                        /* MSCAN4 Receive Data Segment Register 3; 0x000002A7 */
volatile CAN4RXDSR4STR _CAN4RXDSR4;                        /* MSCAN4 Receive Data Segment Register 4; 0x000002A8 */
volatile CAN4RXDSR5STR _CAN4RXDSR5;                        /* MSCAN4 Receive Data Segment Register 5; 0x000002A9 */
volatile CAN4RXDSR6STR _CAN4RXDSR6;                        /* MSCAN4 Receive Data Segment Register 6; 0x000002AA */
volatile CAN4RXDSR7STR _CAN4RXDSR7;                        /* MSCAN4 Receive Data Segment Register 7; 0x000002AB */
volatile CAN4RXDLRSTR _CAN4RXDLR;                          /* MSCAN4 Receive Data Length Register; 0x000002AC */
volatile CAN4TXIDR0STR _CAN4TXIDR0;                        /* MSCAN4 Transmit Identifier Register 0; 0x000002B0 */
volatile CAN4TXIDR1STR _CAN4TXIDR1;                        /* MSCAN4 Transmit Identifier Register 1; 0x000002B1 */
volatile CAN4TXIDR2STR _CAN4TXIDR2;                        /* MSCAN4 Transmit Identifier Register 2; 0x000002B2 */
volatile CAN4TXIDR3STR _CAN4TXIDR3;                        /* MSCAN4 Transmit Identifier Register 3; 0x000002B3 */
volatile CAN4TXDSR0STR _CAN4TXDSR0;                        /* MSCAN4 Transmit Data Segment Register 0; 0x000002B4 */
volatile CAN4TXDSR1STR _CAN4TXDSR1;                        /* MSCAN4 Transmit Data Segment Register 1; 0x000002B5 */
volatile CAN4TXDSR2STR _CAN4TXDSR2;                        /* MSCAN4 Transmit Data Segment Register 2; 0x000002B6 */
volatile CAN4TXDSR3STR _CAN4TXDSR3;                        /* MSCAN4 Transmit Data Segment Register 3; 0x000002B7 */
volatile CAN4TXDSR4STR _CAN4TXDSR4;                        /* MSCAN4 Transmit Data Segment Register 4; 0x000002B8 */
volatile CAN4TXDSR5STR _CAN4TXDSR5;                        /* MSCAN4 Transmit Data Segment Register 5; 0x000002B9 */
volatile CAN4TXDSR6STR _CAN4TXDSR6;                        /* MSCAN4 Transmit Data Segment Register 6; 0x000002BA */
volatile CAN4TXDSR7STR _CAN4TXDSR7;                        /* MSCAN4 Transmit Data Segment Register 7; 0x000002BB */
volatile CAN4TXDLRSTR _CAN4TXDLR;                          /* MSCAN4 Transmit Data Length Register; 0x000002BC */
volatile CAN4TXTBPRSTR _CAN4TXTBPR;                        /* MSCAN4 Transmit Buffer Priority; 0x000002BD */
volatile ATD0STAT0STR _ATD0STAT0;                          /* ATD 0 Status Register 0; 0x000002C6 */
volatile VREGHTCLSTR _VREGHTCL;                            /* HT Control Register; 0x000002F0 */
volatile VREGCTRLSTR _VREGCTRL;                            /* Control Register; 0x000002F1 */
volatile VREGAPICLSTR _VREGAPICL;                          /* Autonomous Periodical Interrupt Control Register; 0x000002F2 */
volatile VREGAPITRSTR _VREGAPITR;                          /* Autonomous Periodical Interrupt Trimming Register; 0x000002F3 */
volatile VREGHTTRSTR _VREGHTTR;                            /* HTTrimming Register; 0x000002F7 */
volatile PWMESTR _PWME;                                    /* PWM Enable Register; 0x00000300 */
volatile PWMPOLSTR _PWMPOL;                                /* PWM Polarity Register; 0x00000301 */
volatile PWMCLKSTR _PWMCLK;                                /* PWM Clock Select Register; 0x00000302 */
volatile PWMPRCLKSTR _PWMPRCLK;                            /* PWM Prescale Clock Select Register; 0x00000303 */
volatile PWMCAESTR _PWMCAE;                                /* PWM Center Align Enable Register; 0x00000304 */
volatile PWMCTLSTR _PWMCTL;                                /* PWM Control Register; 0x00000305 */
volatile PWMSCLASTR _PWMSCLA;                              /* PWM Scale A Register; 0x00000308 */
volatile PWMSCLBSTR _PWMSCLB;                              /* PWM Scale B Register; 0x00000309 */
volatile PWMSDNSTR _PWMSDN;                                /* PWM Shutdown Register; 0x00000324 */
volatile SCI6ACR2STR _SCI6ACR2;                            /* SCI 6 Alternative Control Register 2; 0x00000332 */
volatile SCI6CR2STR _SCI6CR2;                              /* SCI 6 Control Register 2; 0x00000333 */
volatile SCI6SR1STR _SCI6SR1;                              /* SCI 6 Status Register 1; 0x00000334 */
volatile SCI6SR2STR _SCI6SR2;                              /* SCI 6 Status Register 2; 0x00000335 */
volatile SCI6DRHSTR _SCI6DRH;                              /* SCI 6 Data Register High; 0x00000336 */
volatile SCI6DRLSTR _SCI6DRL;                              /* SCI 6 Data Register Low; 0x00000337 */
volatile SCI7ACR2STR _SCI7ACR2;                            /* SCI 7 Alternative Control Register 2; 0x0000033A */
volatile SCI7CR2STR _SCI7CR2;                              /* SCI 7 Control Register 2; 0x0000033B */
volatile SCI7SR1STR _SCI7SR1;                              /* SCI 7 Status Register 1; 0x0000033C */
volatile SCI7SR2STR _SCI7SR2;                              /* SCI 7 Status Register 2; 0x0000033D */
volatile SCI7DRHSTR _SCI7DRH;                              /* SCI 7 Data Register High; 0x0000033E */
volatile SCI7DRLSTR _SCI7DRL;                              /* SCI 7 Data Register Low; 0x0000033F */
volatile PITCFLMTSTR _PITCFLMT;                            /* PIT Control and Force Load Micro Timer Register; 0x00000340 */
volatile PITFLTSTR _PITFLT;                                /* PIT Force Load Timer Register; 0x00000341 */
volatile PITCESTR _PITCE;                                  /* PIT Channel Enable Register; 0x00000342 */
volatile PITMUXSTR _PITMUX;                                /* PIT Multiplex Register; 0x00000343 */
volatile PITINTESTR _PITINTE;                              /* PIT Interrupt Enable Register; 0x00000344 */
volatile PITTFSTR _PITTF;                                  /* PIT Time-out Flag Register; 0x00000345 */
volatile PITMTLD0STR _PITMTLD0;                            /* PIT Micro Timer Load Register 0; 0x00000346 */
volatile PITMTLD1STR _PITMTLD1;                            /* PIT Micro Timer Load Register 1; 0x00000347 */
volatile PTRSTR _PTR;                                      /* Port R Data Register; 0x00000368 */
volatile PTIRSTR _PTIR;                                    /* Port R Input Register; 0x00000369 */
volatile DDRRSTR _DDRR;                                    /* Port R Data Direction Register; 0x0000036A */
volatile RDRRSTR _RDRR;                                    /* Port R Reduced Drive Register; 0x0000036B */
volatile PERRSTR _PERR;                                    /* Port R Pull Device Enable Register; 0x0000036C */
volatile PPSRSTR _PPSR;                                    /* Port R Polarity Select Register; 0x0000036D */
volatile PTRRRSTR _PTRRR;                                  /* Port R Routing Register; 0x0000036F */
volatile PTLSTR _PTL;                                      /* Port L Data Register; 0x00000370 */
volatile PTILSTR _PTIL;                                    /* Port L Input Register; 0x00000371 */
volatile DDRLSTR _DDRL;                                    /* Port L Data Direction Register; 0x00000372 */
volatile RDRLSTR _RDRL;                                    /* Port L Reduced Drive Register; 0x00000373 */
volatile PERLSTR _PERL;                                    /* Port L Pull Device Enable Register; 0x00000374 */
volatile PPSLSTR _PPSL;                                    /* Port L Polarity Select Register; 0x00000375 */
volatile WOMLSTR _WOML;                                    /* Port L Wired-Or Mode Register; 0x00000376 */
volatile PTLRRSTR _PTLRR;                                  /* Port L Routing Register; 0x00000377 */
volatile PTFSTR _PTF;                                      /* Port F Data Register; 0x00000378 */
volatile PTIFSTR _PTIF;                                    /* Port F Input Register; 0x00000379 */
volatile DDRFSTR _DDRF;                                    /* Port F Data Direction Register; 0x0000037A */
volatile RDRFSTR _RDRF;                                    /* Port F Reduced Drive Register; 0x0000037B */
volatile PERFSTR _PERF;                                    /* Port F Pull Device Enable Register; 0x0000037C */
volatile PPSFSTR _PPSF;                                    /* Port F Polarity Select Register; 0x0000037D */
volatile PTFRRSTR _PTFRR;                                  /* Port F Routing Register; 0x0000037F */
volatile XGCHIDSTR _XGCHID;                                /* XGATE Channel ID Register; 0x00000382 */
volatile XGCHPLSTR _XGCHPL;                                /* XGATE Channel Priority Level; 0x00000383 */
volatile XGISPSELSTR _XGISPSEL;                            /* XGATE Initial Stack Pointer Select Register; 0x00000385 */
volatile XGCCRSTR _XGCCR;                                  /* XGATE Condition Code Register; 0x0000039D */
volatile TIM_TIOSSTR _TIM_TIOS;                            /* Timer Input Capture/Output Compare Select; 0x000003D0 */
volatile TIM_CFORCSTR _TIM_CFORC;                          /* Timer Compare Force Register; 0x000003D1 */
volatile TIM_OC7MSTR _TIM_OC7M;                            /* Output Compare 7 Mask Register; 0x000003D2 */
volatile TIM_OC7DSTR _TIM_OC7D;                            /* Output Compare 7 Data Register; 0x000003D3 */
volatile TIM_TSCR1STR _TIM_TSCR1;                          /* Timer System Control Register1; 0x000003D6 */
volatile TIM_TTOVSTR _TIM_TTOV;                            /* Timer Toggle On Overflow Register; 0x000003D7 */
volatile TIM_TCTL1STR _TIM_TCTL1;                          /* Timer Control Register 1; 0x000003D8 */
volatile TIM_TCTL2STR _TIM_TCTL2;                          /* Timer Control Register 2; 0x000003D9 */
volatile TIM_TCTL3STR _TIM_TCTL3;                          /* Timer Control Register 3; 0x000003DA */
volatile TIM_TCTL4STR _TIM_TCTL4;                          /* Timer Control Register 4; 0x000003DB */
volatile TIM_TIESTR _TIM_TIE;                              /* Timer Interrupt Enable Register; 0x000003DC */
volatile TIM_TSCR2STR _TIM_TSCR2;                          /* Timer System Control Register 2; 0x000003DD */
volatile TIM_TFLG1STR _TIM_TFLG1;                          /* Main Timer Interrupt Flag 1; 0x000003DE */
volatile TIM_TFLG2STR _TIM_TFLG2;                          /* Main Timer Interrupt Flag 2; 0x000003DF */
volatile TIM_PACTLSTR _TIM_PACTL;                          /* 16-Bit Pulse Accumulator A Control Register; 0x000003F0 */
volatile TIM_PAFLGSTR _TIM_PAFLG;                          /* Pulse Accumulator A Flag Register; 0x000003F1 */
volatile TIM_OCPDSTR _TIM_OCPD;                            /* Output Compare Pin Disconnect Register; 0x000003FC */
volatile TIM_PTPSRSTR _TIM_PTPSR;                          /* Precision Timer Prescaler Select Register; 0x000003FE */
/* NVFPROT - macro for reading non volatile register       Non Volatile P-Flash Protection Register; 0x0000FF0C */
/* NVEPROT - macro for reading non volatile register       Non Volatile EEE Protection Register; 0x0000FF0D */
/* NVFOPT - macro for reading non volatile register        Non Volatile Flash Option Register; 0x0000FF0E */
/* NVFSEC - macro for reading non volatile register        Non Volatile Flash Security Register; 0x0000FF0F */


