parai/GaInOS/Bsp/9s12xep100/Project/Sources/MC9S12XEP100.c
/* * * * *  16-BIT REGISTERS  * * * * * * * * * * * * * * * */
volatile PORTABSTR _PORTAB;                                /* Port AB Data Register; 0x00000000 */
volatile DDRABSTR _DDRAB;                                  /* Port AB Data Direction Register; 0x00000002 */
volatile PORTCDSTR _PORTCD;                                /* Port CD Data Register; 0x00000004 */
volatile DDRCDSTR _DDRCD;                                  /* Port CD Data Direction Register; 0x00000006 */
volatile PARTIDSTR _PARTID;                                /* Part ID Register; 0x0000001A */
volatile DBGTBSTR _DBGTB;                                  /* Debug Trace Buffer Register; 0x00000024 */
volatile ECT_TCNTSTR _ECT_TCNT;                            /* Timer Count Register; 0x00000044 */
volatile ECT_TC0STR _ECT_TC0;                              /* Timer Input Capture/Output Compare Register 0; 0x00000050 */
volatile ECT_TC1STR _ECT_TC1;                              /* Timer Input Capture/Output Compare Register 1; 0x00000052 */
volatile ECT_TC2STR _ECT_TC2;                              /* Timer Input Capture/Output Compare Register 2; 0x00000054 */
volatile ECT_TC3STR _ECT_TC3;                              /* Timer Input Capture/Output Compare Register 3; 0x00000056 */
volatile ECT_TC4STR _ECT_TC4;                              /* Timer Input Capture/Output Compare Register 4; 0x00000058 */
volatile ECT_TC5STR _ECT_TC5;                              /* Timer Input Capture/Output Compare Register 5; 0x0000005A */
volatile ECT_TC6STR _ECT_TC6;                              /* Timer Input Capture/Output Compare Register 6; 0x0000005C */
volatile ECT_TC7STR _ECT_TC7;                              /* Timer Input Capture/Output Compare Register 7; 0x0000005E */
volatile ECT_PACN32STR _ECT_PACN32;                        /* Pulse Accumulators Count 32 Register; 0x00000062 */
volatile ECT_PACN10STR _ECT_PACN10;                        /* Pulse Accumulators Count 10 Register; 0x00000064 */
volatile ECT_PA32HSTR _ECT_PA32H;                          /* 8-Bit Pulse Accumulators Holding 32 Register; 0x00000072 */
volatile ECT_PA10HSTR _ECT_PA10H;                          /* 8-Bit Pulse Accumulators Holding 10 Register; 0x00000074 */
volatile ECT_MCCNTSTR _ECT_MCCNT;                          /* Modulus Down-Counter Count Register; 0x00000076 */
volatile ECT_TC0HSTR _ECT_TC0H;                            /* Timer Input Capture Holding Registers 0; 0x00000078 */
volatile ECT_TC1HSTR _ECT_TC1H;                            /* Timer Input Capture Holding Registers 1; 0x0000007A */
volatile ECT_TC2HSTR _ECT_TC2H;                            /* Timer Input Capture Holding Registers 2; 0x0000007C */
volatile ECT_TC3HSTR _ECT_TC3H;                            /* Timer Input Capture Holding Registers 3; 0x0000007E */
volatile ATD1CTL01STR _ATD1CTL01;                          /* ATD 1 Control Register 01; 0x00000080 */
volatile ATD1CTL23STR _ATD1CTL23;                          /* ATD 1 Control Register 23; 0x00000082 */
volatile ATD1CTL45STR _ATD1CTL45;                          /* ATD 1 Control Register 45; 0x00000084 */
volatile ATD1CMPESTR _ATD1CMPE;                            /* ATD 1 Compare Enable Register; 0x00000088 */
volatile ATD1STAT2STR _ATD1STAT2;                          /* ATD 1 Status Register 2; 0x0000008A */
volatile ATD1DIENSTR _ATD1DIEN;                            /* ATD 1 Input Enable Register; 0x0000008C */
volatile ATD1CMPHTSTR _ATD1CMPHT;                          /* ATD 1 Compare Higher Than Register; 0x0000008E */
volatile ATD1DR0STR _ATD1DR0;                              /* ATD 1 Conversion Result Register 0; 0x00000090 */
volatile ATD1DR1STR _ATD1DR1;                              /* ATD 1 Conversion Result Register 1; 0x00000092 */
volatile ATD1DR2STR _ATD1DR2;                              /* ATD 1 Conversion Result Register 2; 0x00000094 */
volatile ATD1DR3STR _ATD1DR3;                              /* ATD 1 Conversion Result Register 3; 0x00000096 */
volatile ATD1DR4STR _ATD1DR4;                              /* ATD 1 Conversion Result Register 4; 0x00000098 */
volatile ATD1DR5STR _ATD1DR5;                              /* ATD 1 Conversion Result Register 5; 0x0000009A */
volatile ATD1DR6STR _ATD1DR6;                              /* ATD 1 Conversion Result Register 6; 0x0000009C */
volatile ATD1DR7STR _ATD1DR7;                              /* ATD 1 Conversion Result Register 7; 0x0000009E */
volatile ATD1DR8STR _ATD1DR8;                              /* ATD 1 Conversion Result Register 8; 0x000000A0 */
volatile ATD1DR9STR _ATD1DR9;                              /* ATD 1 Conversion Result Register 9; 0x000000A2 */
volatile ATD1DR10STR _ATD1DR10;                            /* ATD 1 Conversion Result Register 10; 0x000000A4 */
volatile ATD1DR11STR _ATD1DR11;                            /* ATD 1 Conversion Result Register 11; 0x000000A6 */
volatile ATD1DR12STR _ATD1DR12;                            /* ATD 1 Conversion Result Register 12; 0x000000A8 */
volatile ATD1DR13STR _ATD1DR13;                            /* ATD 1 Conversion Result Register 13; 0x000000AA */
volatile ATD1DR14STR _ATD1DR14;                            /* ATD 1 Conversion Result Register 14; 0x000000AC */
volatile ATD1DR15STR _ATD1DR15;                            /* ATD 1 Conversion Result Register 15; 0x000000AE */
volatile SCI2BDSTR _SCI2BD;                                /* SCI 2 Baud Rate Register; 0x000000B8 */
volatile SCI3BDSTR _SCI3BD;                                /* SCI 3 Baud Rate Register; 0x000000C0 */
volatile SCI0BDSTR _SCI0BD;                                /* SCI 0 Baud Rate Register; 0x000000C8 */
volatile SCI1BDSTR _SCI1BD;                                /* SCI 1 Baud Rate Register; 0x000000D0 */
volatile SPI0DRSTR _SPI0DR;                                /* SPI 0 Data Register; 0x000000DC */
volatile SPI1DRSTR _SPI1DR;                                /* SPI 1 Data Register; 0x000000F4 */
volatile SPI2DRSTR _SPI2DR;                                /* SPI 2 Data Register; 0x000000FC */
volatile FCCOBSTR _FCCOB;                                  /* Flash Common Command Object Register; 0x0000010A */
volatile ETAGSTR _ETAG;                                    /* EEE Tag Counter Register; 0x0000010C */
volatile FECCRSTR _FECCR;                                  /* Flash ECC Error Results Register; 0x0000010E */
volatile SCI4BDSTR _SCI4BD;                                /* SCI 4 Baud Rate Register; 0x00000130 */
volatile SCI5BDSTR _SCI5BD;                                /* SCI 5 Baud Rate Register; 0x00000138 */
volatile CAN0RXTSRSTR _CAN0RXTSR;                          /* MSCAN0 Receive Time Stamp Register; 0x0000016E */
volatile CAN0TXTSRSTR _CAN0TXTSR;                          /* MSCAN0 Transmit Time Stamp Register; 0x0000017E */
volatile CAN1RXTSRSTR _CAN1RXTSR;                          /* MSCAN1 Receive Time Stamp Register; 0x000001AE */
volatile CAN1TXTSRSTR _CAN1TXTSR;                          /* MSCAN1 Transmit Time Stamp Register; 0x000001BE */
volatile CAN2RXTSRSTR _CAN2RXTSR;                          /* MSCAN2 Receive Time Stamp Register; 0x000001EE */
volatile CAN2TXTSRSTR _CAN2TXTSR;                          /* MSCAN2 Transmit Time Stamp Register; 0x000001FE */
volatile CAN3RXTSRSTR _CAN3RXTSR;                          /* MSCAN3 Receive Time Stamp Register; 0x0000022E */
volatile CAN3TXTSRSTR _CAN3TXTSR;                          /* MSCAN3 Transmit Time Stamp Register; 0x0000023E */
volatile PT01AD0STR _PT01AD0;                              /* Port AD0 Data Register; 0x00000270 */
volatile DDR01AD0STR _DDR01AD0;                            /* Port AD0 Data Direction Register; 0x00000272 */
volatile RDR01AD0STR _RDR01AD0;                            /* Port AD0 Reduced Drive Register; 0x00000274 */
volatile PER01AD0STR _PER01AD0;                            /* Port AD0 Pull Up Enable Register; 0x00000276 */
volatile PT01AD1STR _PT01AD1;                              /* Port AD1 Data Register; 0x00000278 */
volatile DDR01AD1STR _DDR01AD1;                            /* Port AD1 Data Direction Register; 0x0000027A */
volatile RDR01AD1STR _RDR01AD1;                            /* Port AD1 Reduced Drive Register; 0x0000027C */
volatile PER01AD1STR _PER01AD1;                            /* Port AD1 Pull Up Enable Register; 0x0000027E */
volatile CAN4RXTSRSTR _CAN4RXTSR;                          /* MSCAN4 Receive Time Stamp Register; 0x000002AE */
volatile CAN4TXTSRSTR _CAN4TXTSR;                          /* MSCAN4 Transmit Time Stamp Register; 0x000002BE */
volatile ATD0CTL01STR _ATD0CTL01;                          /* ATD 0 Control Register 01; 0x000002C0 */
volatile ATD0CTL23STR _ATD0CTL23;                          /* ATD 0 Control Register 23; 0x000002C2 */
volatile ATD0CTL45STR _ATD0CTL45;                          /* ATD 0 Control Register 45; 0x000002C4 */
volatile ATD0CMPESTR _ATD0CMPE;                            /* ATD 0 Compare Enable Register; 0x000002C8 */
volatile ATD0STAT2STR _ATD0STAT2;                          /* ATD 0 Status Register 2; 0x000002CA */
volatile ATD0DIENSTR _ATD0DIEN;                            /* ATD 0 Input Enable Register; 0x000002CC */
volatile ATD0CMPHTSTR _ATD0CMPHT;                          /* ATD 0 Compare Higher Than Register; 0x000002CE */
volatile ATD0DR0STR _ATD0DR0;                              /* ATD 0 Conversion Result Register 0; 0x000002D0 */
volatile ATD0DR1STR _ATD0DR1;                              /* ATD 0 Conversion Result Register 1; 0x000002D2 */
volatile ATD0DR2STR _ATD0DR2;                              /* ATD 0 Conversion Result Register 2; 0x000002D4 */
volatile ATD0DR3STR _ATD0DR3;                              /* ATD 0 Conversion Result Register 3; 0x000002D6 */
volatile ATD0DR4STR _ATD0DR4;                              /* ATD 0 Conversion Result Register 4; 0x000002D8 */
volatile ATD0DR5STR _ATD0DR5;                              /* ATD 0 Conversion Result Register 5; 0x000002DA */
volatile ATD0DR6STR _ATD0DR6;                              /* ATD 0 Conversion Result Register 6; 0x000002DC */
volatile ATD0DR7STR _ATD0DR7;                              /* ATD 0 Conversion Result Register 7; 0x000002DE */
volatile ATD0DR8STR _ATD0DR8;                              /* ATD 0 Conversion Result Register 8; 0x000002E0 */
volatile ATD0DR9STR _ATD0DR9;                              /* ATD 0 Conversion Result Register 9; 0x000002E2 */
volatile ATD0DR10STR _ATD0DR10;                            /* ATD 0 Conversion Result Register 10; 0x000002E4 */
volatile ATD0DR11STR _ATD0DR11;                            /* ATD 0 Conversion Result Register 11; 0x000002E6 */
volatile ATD0DR12STR _ATD0DR12;                            /* ATD 0 Conversion Result Register 12; 0x000002E8 */
volatile ATD0DR13STR _ATD0DR13;                            /* ATD 0 Conversion Result Register 13; 0x000002EA */
volatile ATD0DR14STR _ATD0DR14;                            /* ATD 0 Conversion Result Register 14; 0x000002EC */
volatile ATD0DR15STR _ATD0DR15;                            /* ATD 0 Conversion Result Register 15; 0x000002EE */
volatile VREGAPIRSTR _VREGAPIR;                            /* Autonomous Periodical Interrupt Rate Register; 0x000002F4 */
volatile PWMCNT01STR _PWMCNT01;                            /* PWM Channel Counter 01 Register; 0x0000030C */
volatile PWMCNT23STR _PWMCNT23;                            /* PWM Channel Counter 23 Register; 0x0000030E */
volatile PWMCNT45STR _PWMCNT45;                            /* PWM Channel Counter 45 Register; 0x00000310 */
volatile PWMCNT67STR _PWMCNT67;                            /* PWM Channel Counter 67 Register; 0x00000312 */
volatile PWMPER01STR _PWMPER01;                            /* PWM Channel Period 01 Register; 0x00000314 */
volatile PWMPER23STR _PWMPER23;                            /* PWM Channel Period 23 Register; 0x00000316 */
volatile PWMPER45STR _PWMPER45;                            /* PWM Channel Period 45 Register; 0x00000318 */
volatile PWMPER67STR _PWMPER67;                            /* PWM Channel Period 67 Register; 0x0000031A */
volatile PWMDTY01STR _PWMDTY01;                            /* PWM Channel Duty 01 Register; 0x0000031C */
volatile PWMDTY23STR _PWMDTY23;                            /* PWM Channel Duty 23 Register; 0x0000031E */
volatile PWMDTY45STR _PWMDTY45;                            /* PWM Channel Duty 45 Register; 0x00000320 */
volatile PWMDTY67STR _PWMDTY67;                            /* PWM Channel Duty 67 Register; 0x00000322 */
volatile SCI6BDSTR _SCI6BD;                                /* SCI 6 Baud Rate Register; 0x00000330 */
volatile SCI7BDSTR _SCI7BD;                                /* SCI 7 Baud Rate Register; 0x00000338 */
volatile PITLD0STR _PITLD0;                                /* PIT Load Register 0; 0x00000348 */
volatile PITCNT0STR _PITCNT0;                              /* PIT Count Register 0; 0x0000034A */
volatile PITLD1STR _PITLD1;                                /* PIT Load Register 1; 0x0000034C */
volatile PITCNT1STR _PITCNT1;                              /* PIT Count Register 1; 0x0000034E */
volatile PITLD2STR _PITLD2;                                /* PIT Load Register 2; 0x00000350 */
volatile PITCNT2STR _PITCNT2;                              /* PIT Count Register 2; 0x00000352 */
volatile PITLD3STR _PITLD3;                                /* PIT Load Register 3; 0x00000354 */
volatile PITCNT3STR _PITCNT3;                              /* PIT Count Register 3; 0x00000356 */
volatile PITLD4STR _PITLD4;                                /* PIT Load Register 4; 0x00000358 */
volatile PITCNT4STR _PITCNT4;                              /* PIT Count Register 4; 0x0000035A */
volatile PITLD5STR _PITLD5;                                /* PIT Load Register 5; 0x0000035C */
volatile PITCNT5STR _PITCNT5;                              /* PIT Count Register 5; 0x0000035E */
volatile PITLD6STR _PITLD6;                                /* PIT Load Register 6; 0x00000360 */
volatile PITCNT6STR _PITCNT6;                              /* PIT Count Register 6; 0x00000362 */
volatile PITLD7STR _PITLD7;                                /* PIT Load Register 7; 0x00000364 */
volatile PITCNT7STR _PITCNT7;                              /* PIT Count Register 7; 0x00000366 */
volatile XGMCTLSTR _XGMCTL;                                /* XGATE Control Register; 0x00000380 */
volatile XGISP31STR _XGISP31;                              /* XGATE Initial Stack Pointer for Interrupt Priorities 3 to 1; 0x00000386 */
volatile XGIF_7F_70STR _XGIF_7F_70;                        /* XGATE Channel Interrupt Flag Vector; 0x00000388 */
volatile XGIF_6F_60STR _XGIF_6F_60;                        /* XGATE Channel Interrupt Flag Vector; 0x0000038A */
volatile XGIF_5F_50STR _XGIF_5F_50;                        /* XGATE Channel Interrupt Flag Vector; 0x0000038C */
volatile XGIF_4F_40STR _XGIF_4F_40;                        /* XGATE Channel Interrupt Flag Vector; 0x0000038E */
volatile XGIF_3F_30STR _XGIF_3F_30;                        /* XGATE Channel Interrupt Flag Vector; 0x00000390 */
volatile XGIF_2F_20STR _XGIF_2F_20;                        /* XGATE Channel Interrupt Flag Vector; 0x00000392 */
volatile XGIF_1F_10STR _XGIF_1F_10;                        /* XGATE Channel Interrupt Flag Vector; 0x00000394 */
volatile XGIF_0F_00STR _XGIF_0F_00;                        /* XGATE Channel Interrupt Flag Vector; 0x00000396 */
volatile XGSWTSTR _XGSWT;                                  /* XGATE Control Register; 0x00000398 */
volatile XGSEMSTR _XGSEM;                                  /* XGATE Semaphore Register; 0x0000039A */
volatile XGPCSTR _XGPC;                                    /* XGATE Program Counter Register; 0x0000039E */
volatile XGR1STR _XGR1;                                    /* XGATE Register 1; 0x000003A2 */
volatile XGR2STR _XGR2;                                    /* XGATE Register 2; 0x000003A4 */
volatile XGR3STR _XGR3;                                    /* XGATE Register 3; 0x000003A6 */
volatile XGR4STR _XGR4;                                    /* XGATE Register 4; 0x000003A8 */
volatile XGR5STR _XGR5;                                    /* XGATE Register 5; 0x000003AA */
volatile XGR6STR _XGR6;                                    /* XGATE Register 6; 0x000003AC */
volatile XGR7STR _XGR7;                                    /* XGATE Register 7; 0x000003AE */
volatile TIM_TCNTSTR _TIM_TCNT;                            /* Timer Count Register; 0x000003D4 */
volatile TIM_TC0STR _TIM_TC0;                              /* Timer Input Capture/Output Compare Register 0; 0x000003E0 */
volatile TIM_TC1STR _TIM_TC1;                              /* Timer Input Capture/Output Compare Register 1; 0x000003E2 */
volatile TIM_TC2STR _TIM_TC2;                              /* Timer Input Capture/Output Compare Register 2; 0x000003E4 */
volatile TIM_TC3STR _TIM_TC3;                              /* Timer Input Capture/Output Compare Register 3; 0x000003E6 */
volatile TIM_TC4STR _TIM_TC4;                              /* Timer Input Capture/Output Compare Register 4; 0x000003E8 */
volatile TIM_TC5STR _TIM_TC5;                              /* Timer Input Capture/Output Compare Register 5; 0x000003EA */
volatile TIM_TC6STR _TIM_TC6;                              /* Timer Input Capture/Output Compare Register 6; 0x000003EC */
volatile TIM_TC7STR _TIM_TC7;                              /* Timer Input Capture/Output Compare Register 7; 0x000003EE */
volatile TIM_PACNTSTR _TIM_PACNT;                          /* Pulse Accumulators Count Register; 0x000003F2 */
/* BAKEY0 - macro for reading non volatile register        Backdoor Comparison Key 0; 0x0000FF00 */
/* BAKEY1 - macro for reading non volatile register        Backdoor Comparison Key 1; 0x0000FF02 */
/* BAKEY2 - macro for reading non volatile register        Backdoor Comparison Key 2; 0x0000FF04 */
/* BAKEY3 - macro for reading non volatile register        Backdoor Comparison Key 3; 0x0000FF06 */

/*lint -restore */

/* EOF */
